/*==============================================================================

   敵管理[block.h]
														 Author :
														 Date   :
--------------------------------------------------------------------------------

==============================================================================*/
#pragma once


#include "main.h"
#include "renderer.h"
#include "map.h"

//*****************************************************************************
// マクロ定義
//*****************************************************************************
#define MAX_BLOCK (MAP_SIZE_HEIGHT * MAP_SIZE_WIDTH) //実体の個数 （画面内に同時に存在できる数）

//*****************************************************************************
// グローバル変数
//*****************************************************************************
struct BLOCK {
	D3DXVECTOR2		pos;	//位置ベクトル
	D3DXVECTOR2		size;	//サイズ
	int				type;
	bool			use;	//使用フラグ
};

//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************
void InitBlock(void);
void UninitBlock(void);
void UpdateBlock(void);
void DrawBlock(void);
void SetBlock(D3DXVECTOR2 spos, D3DXVECTOR2 ssize,int stype);
BLOCK* GetBlock(void);


