/*==============================================================================

   敵管理[enemy.h]
														 Author :
														 Date   :
--------------------------------------------------------------------------------

==============================================================================*/
#pragma once

#include "main.h"
#include "renderer.h"

//*****************************************************************************
// マクロ定義
//*****************************************************************************
#define MAX_ENEMY (25) //実体の個数 （画面内に同時に存在できる数）

//*****************************************************************************
// グローバル変数
//*****************************************************************************
struct ENEMY {
	D3DXVECTOR2		pos;	//位置ベクトル
	D3DXVECTOR2		vel;	//速度ベクトル
	D3DXVECTOR2		size;	//サイズ
	D3DXVECTOR2     uv;
	float			rot;	//回転情報
	bool			use;	//使用フラグ
	int g_Animeskipframe;
	int g_AnimePattern;
};

//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************
void InitEnemy(void);
void UninitEnemy(void);
void UpdateEnemy(void);
void DrawEnemy(void);
void SetEnemy(D3DXVECTOR2 spos, D3DXVECTOR2 svel, D3DXVECTOR2 ssize);
ENEMY* GetEnemy(void);

