/*==============================================================================

   マップ管理[map.h]
														 Author :関谷　勇人
														 Date   :2023/06/29
--------------------------------------------------------------------------------

==============================================================================*/
#pragma once

#include "main.h"
#include "renderer.h"

//*****************************************************************************
// マクロ定義
//*****************************************************************************
#define STAGE_WIDTH (1920 * 10)					// ステージの横幅
#define STAGE_HEIGHT (1080 * 2)					// ステージの縦幅
#define MAPCHIP_WIDTH (54)					// マップチップの横幅
#define MAPCHIP_HEIGHT (54)					// マップチップの縦幅
#define MAP_SIZE_WIDTH (STAGE_WIDTH / MAPCHIP_WIDTH)		// MAPの横幅(値はチップ数)
#define MAP_SIZE_HEIGHT (STAGE_HEIGHT / MAPCHIP_HEIGHT)		// MAPの縦幅(値はチップ数)

//*****************************************************************************
// グローバル変数
//*****************************************************************************
struct MAP {
	D3DXVECTOR2		pos;	//位置ベクトル
	D3DXVECTOR2		vel;
	D3DXVECTOR2		uv;

	bool use;//使用フラグ
};

//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************
void InitMap(void);
void UninitMap(void);
void UpdateMap(void);
void DrawMap(void);