// ----------------------------------------------------------
// スコア制御 [score.h]  
// 関谷勇人　2023/09/14
// ----------------------------------------------------------
#pragma once //インクルードガード

// ----------------------------------------------------------
// マクロ定義
// ----------------------------------------------------------
#define SCORE_EFFECT_X (5) //横分割数
#define SCORE_EFFECT_Y (5) //縦分割数
#define SCORE_EFFECT_W (1.0f / SCORE_EFFECT_X)
#define SCORE_EFFECT_H (1.0f / SCORE_EFFECT_Y)
#define SCORE_DIGIT (5) //スコアの桁数

// ----------------------------------------------------------
// 構造体宣言
// ----------------------------------------------------------
typedef struct
{
	D3DXVECTOR2 pos;		//座標
	D3DXVECTOR2 size;	//大きさ

	int score;		//スコア

}SCORE;

// ----------------------------------------------------------
// プロトタイプ宣言
// ----------------------------------------------------------
void InitScore();
void UninitScore();
void UpdateScore();
void DrawScore();
void AddScore(int value);